The  AnalysisDisplayColorEntry  type exposes the following members.
 Properties
Name  |   Description
Color
 Color associated with color entry.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Value
 Value associated with color entry.
 See Also
  AnalysisDisplayColorEntry Class
  Autodesk.Revit.DB.Analysis Namespace